;----------------------------------------------------------------------------
;===================================MyPrint==================================
;----------------------------------------------------------------------------
;							      DESCRIPTION
;----------------------------------------------------------------------------
;
;----------------------------------------------------------------------------


;----------------------------------------------------------------------------
;								  CONSTANTS
;----------------------------------------------------------------------------
END_OF_STRING equ 0d
PERCENT_ASCII equ 37d

;----------------------------------------------------------------------------
;									CODE
;----------------------------------------------------------------------------



section 	.text

global myPrint								;for linker and C code

;----------------------------------------------------------------------------
;myPrint:								WARNING: ALL STRINGS HAVE TO HAVE 0 IN THE END
;
;arguments:
;		di = format string address
;----------------------------------------------------------------------------

;получаем строку, начинаем копировать ее в буффер
;натыкаемся на % - считываем следующий символ и делаем реализацию аргумента
myPrint:

		push rbx
		mov rbx, rsi
		mov rsi, rsp
		xchg rsi, rdi

	bufferization:

		cmp byte [rsi], PERCENT_ASCII
		jne no_percent


	no_percent:

		movsb
		cmp byte [rsi], END_OF_STRING
		jne bufferization

		pop rbx
		ret


section 	.data
buffer:		db 0